runTestCases/initialCases/1_nasaHump/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
10368
(
(-0.852066 6.75187e-06 0.084)
(-0.758669 6.75187e-06 0.084)
(-0.666528 6.75186e-06 0.084)
(-0.577756 6.75186e-06 0.084)
(-0.494163 6.75186e-06 0.084)
(-0.417125 6.75186e-06 0.084)
(-0.347529 6.75186e-06 0.084)
(-0.28578 6.75186e-06 0.084)
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(-0.852065 0 0.084)
(-0.758669 0 0.084)
(-0.666528 0 0.084)
(-0.577755 0 0.084)
(-0.494161 0 0.084)
(-0.417123 0 0.084)
(-0.347527 0 0.084)
(-0.285777 0 0.084)
...
)
;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
54
(
(-0.8988 0.351971 0.084)
(-0.8988 0.296972 0.084)
(-0.8988 0.250567 0.084)
(-0.8988 0.211414 0.084)
(-0.8988 0.178378 0.084)
(-0.8988 0.150505 0.084)
(-0.8988 0.126987 0.084)
(-0.8988 0.107144 0.084)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
54
(
(1.68 6.75187e-06 0.084)
(1.68 2.0451e-05 0.084)
(1.68 3.4742e-05 0.084)
(1.68 5.00384e-05 0.084)
(1.68 6.67828e-05 0.084)
(1.68 8.54598e-05 0.084)
(1.68 0.00010661 0.084)
(1.68 0.000130845 0.084)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(1.62817 0.381801 0.084)
(1.53214 0.381801 0.084)
(1.44979 0.381801 0.084)
(1.37835 0.381801 0.084)
(1.31577 0.381801 0.084)
(1.26048 0.381801 0.084)
(1.21125 0.381801 0.084)
(1.16711 0.381801 0.084)
...
)
;
    }
}


// ************************************************************************* //
