runTestCases/initialCases/1_nasaHump/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
-0.852066
-0.758669
-0.666528
-0.577756
-0.494163
-0.417125
-0.347529
-0.28578
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
-0.852065
-0.758669
-0.666528
-0.577755
-0.494161
-0.417123
-0.347527
-0.285777
...
)
;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
-0.8988
-0.8988
-0.8988
-0.8988
-0.8988
-0.8988
-0.8988
-0.8988
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
1.68
1.68
1.68
1.68
1.68
1.68
1.68
1.68
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
1.62817
1.53214
1.44979
1.37835
1.31577
1.26048
1.21125
1.16711
...
)
;
    }
}


// ************************************************************************* //
