runTestCases/initialCases/1_nasaHump/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
6.75187e-06
6.75187e-06
6.75186e-06
6.75186e-06
6.75186e-06
6.75186e-06
6.75186e-06
6.75186e-06
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
0
0
0
0
0
0
0
0
...
)
;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
0.351971
0.296972
0.250567
0.211414
0.178378
0.150505
0.126987
0.107144
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
6.75187e-06
2.0451e-05
3.4742e-05
5.00384e-05
6.67828e-05
8.54598e-05
0.00010661
0.000130845
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
0.381801
0.381801
0.381801
0.381801
0.381801
0.381801
0.381801
0.381801
...
)
;
    }
}


// ************************************************************************* //
