runTestCases/initialCases/1_nasaHump/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
0.084
0.084
0.084
0.084
0.084
0.084
0.084
0.084
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
0.084
0.084
0.084
0.084
0.084
0.084
0.084
0.084
...
)
;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
0.084
0.084
0.084
0.084
0.084
0.084
0.084
0.084
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
54
(
0.084
0.084
0.084
0.084
0.084
0.084
0.084
0.084
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<scalar> 
192
(
0.084
0.084
0.084
0.084
0.084
0.084
0.084
0.084
...
)
;
    }
}


// ************************************************************************* //
