runTestCases/initialCases/1_nasaHump/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
2.12046e-07
2.11718e-07
2.06347e-07
1.96434e-07
1.82851e-07
1.66689e-07
1.49086e-07
1.31087e-07
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    up
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
