runTestCases/initialCases/1_nasaHump/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
10368
(
2.7246e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    down
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
192
(
2.7246e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
2.72461e+07
...
)
;
    }
    front
    {
        type            empty;
    }
    inlet
    {
        type            timeVaryingMappedFixedValue;
        fieldTable      omega;
        value           nonuniform List<scalar> 
54
(
226.606
226.61
226.615
226.619
226.623
226.625
226.626
226.626
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
