runTestCases/initialCases/1_nasaHump/system/sample_lines_U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a surface, specified by one point and a normal direction.

\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

interpolationScheme	cellPointFace;

setFormat   raw;

fields  (U);

sets
(
line0
{
		type        midPoint;
		axis 			y;
		start 		(0.273		0 		0.084);
		end 			(0.273		0.38	0.084);
}
line1
{
		type        midPoint;
		axis 			y;
		start 		(0.336		0 		0.084);
		end 			(0.336		0.38	0.084);
}
line2
{
		type        midPoint;
		axis 			y;
		start 		(0.378		0 		0.084);
		end 			(0.378		0.38	0.084);
}
line3
{
		type        midPoint;
		axis 			y;
		start 		(0.42		0 		0.084);
		end 			(0.42		0.38	0.084);
}
line4
{
		type        midPoint;
		axis 			y;
		start 		(0.462		0 		0.084);
		end 			(0.462		0.38	0.084);
}
line5
{
		type        midPoint;
		axis 			y;
		start 		(0.504		0 		0.084);
		end 			(0.504		0.38	0.084);
}
line6
{
		type        midPoint;
		axis 			y;
		start 		(0.546		0 		0.084);
		end 			(0.546		0.38	0.084);
}
) ;

// ************************************************************************* //
